#include <iostream>
#include <string>
#define INFINITE 0XFFFFFFF		
#define N 5 // 定义A图的顶点数
#define M 9 // 定义B图的顶点数
using namespace std;

string d1[] = { "A", "B", "C", "D", "E" };
int A[N][N] = {
	//        A  B  C  D  E
	/*A*/     0, 0, 1, 1, 0,
	/*B*/     0, 0, 0, 1, 1,
	/*C*/     1, 0, 0, 1, 1,
	/*D*/     1, 1, 1, 0, 0,
	/*E*/     0, 1, 1, 0, 0, };			// 无向图,该图有环，无法拓扑排序

string d2[] = { "C0", "C1", "C2", "C3","C4","C5","C6","C7","C8" };
int B[M][M] = {
	//C0  C1  C2  C3  C4  C5  C6  C7  C8	
	0, 0, 1, 0, 0, 0, 0, 1, 0,
	0, 0, 1, 1, 1, 0, 0, 0, 0,
	0, 0, 0, 1, 0, 0, 0, 0, 0,
	0, 0, 0, 0, 0, 1, 1, 0, 0,
	0, 0, 0, 0, 0, 1, 0, 0, 0,
	0, 0, 0, 0, 0, 0, 0, 0, 0,
	0, 0, 0, 0, 0, 0, 0, 0, 0,
	0, 0, 0, 0, 0, 0, 0, 0, 1,
	0, 0, 0, 0, 0, 0, 1, 0, 0 };		// 该图为表示课程优先关系的有向无环图，可拓扑排序	


int main() {

	return 0;
}